# Исследование надежности заемщиков

## Первый шаг

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')

In [3]:
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,-4024.803754,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,-5623.422610,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,-4124.747207,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,340266.072047,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [5]:
(21525 - 19351) / 21525

0.10099883855981417

1. В выборке 21525 записей...

In [6]:
data.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,1.935100e+04
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,1.674223e+05
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,1.029716e+05
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,2.066726e+04
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,1.030532e+05
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,1.450179e+05
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,2.034351e+05
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,2.265604e+06

In [7]:
401755 / 365

1100.6986301369864

## Второй шаг

### Обработка пропусков

In [8]:
total_income_median = data['total_income'].median()
data['total_income'] = data['total_income'].fillna(total_income_median)
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income           0
purpose                0
dtype: int64

In [9]:
data['days_employed'].describe()
data['days_employed'].head(20)

0      -8437.673028
1      -4024.803754
2      -5623.422610
3      -4124.747207
4     340266.072047
5       -926.185831
6      -2879.202052
7       -152.779569
8      -6929.865299
9      -2188.756445
10     -4171.483647
11      -792.701887
12              NaN
13     -1846.641941
14     -1844.956182
15      -972.364419
16     -1719.934226
17     -2369.999720
18    400281.136913
19    -10038.818549
Name: days_employed, dtype: float64

In [10]:
def fix_days_employed(value):
  if value < 0:
    return abs(value)
  if value > 0:
    return value / 24

In [11]:
data['days_employed'] = data['days_employed'].apply(fix_days_employed)

In [12]:
data['days_employed'].describe()

count    19351.000000
mean      4641.641176
std       5355.964289
min         24.141633
25%        927.009265
50%       2194.220567
75%       5537.882441
max      18388.949901
Name: days_employed, dtype: float64

In [13]:
days_employed_median = data['days_employed'].median()
data['days_employed'] = data['days_employed'].fillna(days_employed_median)
data.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
dtype: int64

In [14]:
data = data.drop(['days_employed'], axis = 1)
data.head()

,children,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,42,высшее,0,женат / замужем,0,F,сотрудник,0,253875.639453,покупка жилья
1,1,36,среднее,1,женат / замужем,0,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,33,Среднее,1,женат / замужем,0,M,сотрудник,0,145885.952297,покупка жилья
3,3,32,среднее,1,женат / замужем,0,M,сотрудник,0,267628.550329,дополнительное образование
4,0,53,среднее,1,гражданский брак,1,F,пенсионер,0,158616.077870,сыграть свадьбу

In [15]:
data = data.drop(['family_status_id', 'education_id'], axis = 1)
data.head()

,children,dob_years,education,family_status,gender,income_type,debt,total_income,purpose
0,1,42,высшее,женат / замужем,F,сотрудник,0,253875.639453,покупка жилья
1,1,36,среднее,женат / замужем,F,сотрудник,0,112080.014102,приобретение автомобиля
2,0,33,Среднее,женат / замужем,M,сотрудник,0,145885.952297,покупка жилья
3,3,32,среднее,женат / замужем,M,сотрудник,0,267628.550329,дополнительное образование
4,0,53,среднее,гражданский брак,F,пенсионер,0,158616.077870,сыграть свадьбу

### Работа с дубликатами

In [16]:
data['education'].unique()

array(['высшее', 'среднее', 'Среднее', 'СРЕДНЕЕ', 'ВЫСШЕЕ',
       'неоконченное высшее', 'начальное', 'Высшее',
       'НЕОКОНЧЕННОЕ ВЫСШЕЕ', 'Неоконченное высшее', 'НАЧАЛЬНОЕ',
       'Начальное', 'Ученая степень', 'УЧЕНАЯ СТЕПЕНЬ', 'ученая степень'],
      dtype=object)

In [17]:
data['education'] = data['education'].str.lower()
data['education'].unique()

array(['высшее', 'среднее', 'неоконченное высшее', 'начальное',
       'ученая степень'], dtype=object)

In [18]:
data.duplicated().sum()

71

In [19]:
data = data.drop_duplicates().reset_index(drop = True)

In [20]:
data.duplicated().sum()

0

В датасете был обнаружен и удален 71 полный дубликат. А значения в столбце register были приведены к нижнему регистру.

### Изменение типов данных

In [21]:
data['total_income'] = data['total_income'].astype('int64')

In [22]:
data.head()

,children,dob_years,education,family_status,gender,income_type,debt,total_income,purpose
0,1,42,высшее,женат / замужем,F,сотрудник,0,253875,покупка жилья
1,1,36,среднее,женат / замужем,F,сотрудник,0,112080,приобретение автомобиля
2,0,33,среднее,женат / замужем,M,сотрудник,0,145885,покупка жилья
3,3,32,среднее,женат / замужем,M,сотрудник,0,267628,дополнительное образование
4,0,53,среднее,гражданский брак,F,пенсионер,0,158616,сыграть свадьбу

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   children       21454 non-null  int64
 1   dob_years      21454 non-null  int64
 2   education      21454 non-null  object
 3   family_status  21454 non-null  object
 4   gender         21454 non-null  object
 5   income_type    21454 non-null  object
 6   debt           21454 non-null  int64
 7   total_income   21454 non-null  int64
 8   purpose        21454 non-null  object
dtypes: int64(4), object(5)
memory usage: 1.5+ MB

### Категоризация данных

In [24]:
def income_category (income):
  if income <= 30000:
    return 'E'
  if income <= 50000:
    return 'D'
  if income <= 200000:
    return 'C'
  if income <= 1000000:
    return 'B'
  return 'A'

In [25]:
data['total_income_category'] = data['total_income'].apply(income_category)
data.head()

,children,dob_years,education,family_status,gender,income_type,debt,total_income,purpose,total_income_category
0,1,42,высшее,женат / замужем,F,сотрудник,0,253875,покупка жилья,B
1,1,36,среднее,женат / замужем,F,сотрудник,0,112080,приобретение автомобиля,C
2,0,33,среднее,женат / замужем,M,сотрудник,0,145885,покупка жилья,C
3,3,32,среднее,женат / замужем,M,сотрудник,0,267628,дополнительное образование,B
4,0,53,среднее,гражданский брак,F,пенсионер,0,158616,сыграть свадьбу,C

In [26]:
data['debt'].value_counts(normalize = True)

debt
0    0.91885
1    0.08115
Name: proportion, dtype: float64

In [27]:
data['purpose'].unique()

array(['покупка жилья', 'приобретение автомобиля',
       'дополнительное образование', 'сыграть свадьбу',
       'операции с жильем', 'образование', 'на проведение свадьбы',
       'покупка жилья для семьи', 'покупка недвижимости',
       'покупка коммерческой недвижимости', 'покупка жилой недвижимости',
       'строительство собственной недвижимости', 'недвижимость',
       'строительство недвижимости', 'на покупку подержанного автомобиля',
       'на покупку своего автомобиля',
       'операции с коммерческой недвижимостью',
       'строительство жилой недвижимости', 'жилье',
       'операции со своей недвижимостью', 'автомобили',
       'заняться образованием', 'сделка с подержанным автомобилем',
       'получение образования', 'автомобиль', 'свадьба',
       'получение дополнительного образования', 'покупка своего жилья',
       'операции с недвижимостью', 'получение высшего образования',
       'свой автомобиль', 'сделка с автомобилем',
       'профильное образование', 'высшее образование',
       'покупка жилья для сдачи', 'на покупку автомобиля', 'ремонт жилью',
       'заняться высшим образованием'], dtype=object)

In [28]:
wrong_names = ['покупка жилья', 'операции с жильем', 'покупка жилья для семьи',
               'покупка недвижимости', 'покупка коммерческой недвижимости',
               'покупка жилой недвижимости', 'строительство собственной недвижимости', 'недвижимость',
               'строительство недвижимости', 'операции с коммерческой недвижимостью', 'покупка своего жилья', 'операции с недвижимостью',
               'покупка жилья для сдачи', 'ремонт жилью']
right_name = 'операции с недвижимостью'
data['purpose'] = data['purpose'].replace(wrong_names, right_name)

In [29]:
data['purpose'].unique()

array(['операции с недвижимостью', 'приобретение автомобиля',
       'дополнительное образование', 'сыграть свадьбу', 'образование',
       'на проведение свадьбы', 'на покупку подержанного автомобиля',
       'на покупку своего автомобиля', 'строительство жилой недвижимости',
       'жилье', 'операции со своей недвижимостью', 'автомобили',
       'заняться образованием', 'сделка с подержанным автомобилем',
       'получение образования', 'автомобиль', 'свадьба',
       'получение дополнительного образования',
       'получение высшего образования', 'свой автомобиль',
       'сделка с автомобилем', 'профильное образование',
       'высшее образование', 'на покупку автомобиля',
       'заняться высшим образованием'], dtype=object)

In [30]:
data.loc[data['purpose'].str.contains('образов'),'purpose'] = 'получение образования'
data.loc[data['purpose'].str.contains('свадьб'),'purpose'] = 'проведение свадьбы'
data.loc[data['purpose'].str.contains('автомоб'),'purpose'] = 'операции с автомобилем'
data.loc[data['purpose'].str.contains('жиль'),'purpose'] = 'операции с недвижимостью'
data.loc[data['purpose'].str.contains('недвижимост'),'purpose'] = 'операции с недвижимостью'

In [31]:
data['purpose'].unique()

array(['операции с недвижимостью', 'операции с автомобилем',
       'получение образования', 'проведение свадьбы'], dtype=object)

In [32]:
data['purpose'].value_counts()

purpose
операции с недвижимостью    10811
операции с автомобилем       4306
получение образования        4013
проведение свадьбы           2324
Name: count, dtype: int64

## Третий шаг

### Есть ли зависимость между количеством детей и возвратом кредита в срок?

In [33]:
children_groups = data.groupby(by = 'children')['debt'].agg(['sum', 'count'])
children_groups = children_groups.rename(columns={'sum': 'Должников','count': 'Всего'})
children_groups['% должников'] = children_groups['Должников'] / children_groups['Всего'] * 100
children_groups

          Должников  Всего  % должников
children
-1                1     47     2.127660
 0             1063  14091     7.543822
 1              444   4808     9.234609
 2              194   2052     9.454191
 3               27    330     8.181818
 4                4     41     9.756098
 5                0      9     0.000000
 20               8     76    10.526316

### Есть ли зависимость между семейным положением и возвратом кредита в срок?

In [34]:
family_status_groups = data.groupby(by = 'family_status')['debt'].agg(['sum', 'count'])
family_status_groups = family_status_groups.rename(columns={'sum': 'Должников','count': 'Всего'})
family_status_groups['% должников'] = family_status_groups['Должников'] / family_status_groups['Всего'] * 100
family_status_groups

                       Должников  Всего  % должников
family_status
Не женат / не замужем        274   2810     9.750890
в разводе                     85   1195     7.112971
вдовец / вдова                63    959     6.569343
гражданский брак             388   4151     9.347145
женат / замужем              931  12339     7.545182

### Есть ли зависимость между уровнем дохода и возвратом кредита в срок?

In [35]:
gr_data = data.groupby(by = 'total_income_category')['debt'].agg(['sum', 'count'])
gr_data = gr_data.rename(columns={'sum': 'Должников','count': 'Всего'})
gr_data['% должников'] = gr_data['Должников'] / gr_data['Всего'] * 100
gr_data

                       Должников  Всего  % должников
total_income_category
A                              2     25     8.000000
B                            356   5041     7.062091
C                           1360  16016     8.491508
D                             21    350     6.000000
E                              2     22     9.090909

### Как разные цели кредиты влияют на его возврат в срок?

In [36]:
gr_data = data.groupby(by = 'purpose')['debt'].agg(['sum', 'count'])
gr_data = gr_data.rename(columns={'sum': 'Должников','count': 'Всего'})
gr_data['% должников'] = gr_data['Должников'] / gr_data['Всего'] * 100
gr_data

                          Должников  Всего  % должников
purpose
операции с автомобилем          403   4306     9.359034
операции с недвижимостью        782  10811     7.233373
получение образования           370   4013     9.220035
проведение свадьбы              186   2324     8.003442

## Четвертый шаг

Идеальным считается заемщик, который: не имеет детей, является вдовой или вдовцом, с зарплатой, попадающей под категории B и D. Также идеальный тот заемщик, который взял кредит на недвижимость.